trade_exp/src/Documents/БлокировкаДвиженияТоваров/БлокировкаДвиженияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ec36221d-37a4-4c12-9c34-7cb1eceaead1">
  <name>БлокировкаДвиженияТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.РаспределениеЗапасовДвижения</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыИПотребности</registerRecords>
  <attributes extendedConfigurationObject="bcd3b202-1b4b-4cb7-9c80-2a93e9f648db">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8173986d-73df-48fa-9cc8-38cfe45d8748">
    <name>БлокировкаОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5f9d0fad-e42e-4731-8107-06e3f90b212d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="441ea6d9-ec19-4570-b97b-f8e66ebbde99">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8671922f-e1fb-486a-bbb5-fd960e199e94">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="250a0493-3164-44eb-9b46-4baeac4f1c2c">
    <name>ПричинаБлокировки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c23c42b8-9959-4ace-91a6-5a7cbc2fbb63">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="a9f05fa3-fa19-43ed-95dd-01e6677ecdf1">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d8f9f1e5-d2cd-4da7-ad72-aefa73478085">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="89a7e0a8-ebb3-4118-ac5f-b614e1a2fac3">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="42ebd587-1a10-4279-b4c1-ce101094cfa4">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a7742230-e6be-4988-9a70-2b9318d2e6e8">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЦеныНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="ef115090-8fca-4521-9bd1-ecc07f568bec">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="3a3a65ce-80a9-435f-9aa2-21d5add59229">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="aa1025d7-0232-4124-8a64-816e44306389">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/AccumulationRegisters/БлокировкаДвиженияТоваров/БлокировкаДвиженияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d1debd3c-ebad-4fd6-b5cc-a168c5541d0c">
  <name>БлокировкаДвиженияТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="0f146454-5751-41ac-9858-ed8e82493ca9">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="ff486bfa-32f9-483b-a31f-217330dd926b">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ab8e653a-6710-4566-aa65-0d5ea7f238c5">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ce328e11-efc3-4665-b4b8-c81faf099f64">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="cd3fb855-d4a5-4870-b2f5-784d225e96f4">
    <name>ПричинаБлокировки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/Documents/ПеремещениеТоваров/ПеремещениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПеремещениеТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ТоварыОрганизацийКПередачеПеремещения</registerRecords>
  <registerRecords>AccumulationRegister.ДвижениеМаркированногоТовара</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузкеПоНакладным</registerRecords>
  <attributes>
    <name>ПеремещениеПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПеремещениеПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОрганизацияПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗаказНаПеремещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодтвержденПодотчетником</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПеремещениеНаФилиал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВариантПриемкиТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1bfda24a-d445-4b39-8af4-ed67ca72e740">
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3b5a903f-6f26-4f4d-a0a5-cf413f2243b3">
    <name>УведомлениеПодрядчикуОтправлено</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1779da3c-c51d-4f88-b689-8e209e99fe68">
    <name>ПрибытиеНаОтгрузку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="24b1fcdd-19c7-4dc9-b249-704eb17fb2a0">
    <name>ИдентификаторСоздания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2ffb7f4e-66c9-48c5-96e0-1baecd646a67">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c4f22582-806d-4de7-8edb-0315fd4de7e8">
    <name>ВидПодтоварки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dd80c28d-f00c-452e-b502-75210c534406">
    <name>ДатаПоставкиНаСклад</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6cf61f94-1052-4a7d-8b0c-3ca30671d5b1">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8f8abbfa-b9cf-4125-94d5-4bb7574640ca">
    <name>ДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f735e5a6-4870-4db6-896d-baad4431b155">
    <name>ИсключитьИзКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63c178f4-5fe4-4d2f-a3e0-5485d4e0bd64">
    <name>ДатаПринятия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЗаказНаПеремещение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Кладовщик</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1c277ba2-83ae-4afd-9219-7d576048dc52">
      <name>КомментарийОтИнженера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>30</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="91863164-52e3-42fb-98c7-928548d16930">
      <name>Отсканирован</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b9f39c6a-f3b5-4be2-9fb9-68bbcf37b953">
      <name>СпособВводаКоличества</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/БлокировкаДвиженияТоваров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт

	МеханизмыДокумента.Добавить("Обеспечение");
	МеханизмыДокумента.Добавить("БлокировкаДвиженияТоваров");
	
КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка - ссылка на документ, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  Структура - коллекция элементов ТаблицаЗначений с данными для отражения в регистр.
//
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений	
		ЗаполнитьПараметрыИнициализации(Запрос, Документ);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		ТекстЗапросаТаблицаБлокировкаДвиженияНоменклатуры(Запрос, ТекстыЗапроса, Регистры);
	КонецЕсли;
	
	ОтразитьРаспределениеЗапасовДвижения(Запрос, ТекстыЗапроса, Регистры, Документ.Статус);
		
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции  

Процедура ОтразитьРаспределениеЗапасовДвижения(Запрос, ТекстыЗапроса, Регистры, Статус)
	
	Если Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано Тогда	
		ТекстЗапросаТабЧасть =
		"ВЫБРАТЬ
		|	ТабЧасть.Ссылка                              КАК Ссылка,
		|	ТабЧасть.Ссылка.Дата                         КАК Период,
		|	ТабЧасть.Номенклатура                        КАК Номенклатура,
		|	ТабЧасть.Характеристика                      КАК Характеристика,
		|	ТабЧасть.Ссылка.Склад                        КАК Склад,
		|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
		|	ТабЧасть.КоличествоУпаковок                  КАК Количество,
		|	НЕОПРЕДЕЛЕНО                                 КАК ЗапланированныйРасходРаспределенногоЗапаса,
		|	ИСТИНА                                       КАК КонтрольСвободногоОстатка,
		|	ЛОЖЬ                                         КАК ИгнорироватьРезервыПриКонтролеОстатков
		|ИЗ
		|	Документ.БлокировкаДвиженияТоваров.Товары КАК ТабЧасть
		|ГДЕ
		|	НЕ(&ЗаполнятьПлановоеКоличество
		|			И &ОрдернаяСхемаПриПоступлении)";

		РаспределениеЗапасовДвижения.РасходЗапаса(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаТабЧасть);
    ИначеЕсли Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Разблокировано Тогда
		ТекстЗапросаТабЧасть =
		"ВЫБРАТЬ
		|	ТабЧасть.Ссылка                              КАК Ссылка,
		|	ТабЧасть.Ссылка.Дата                         КАК Период,
		|	ТабЧасть.Номенклатура                        КАК Номенклатура,
		|	ТабЧасть.Характеристика                      КАК Характеристика,
		|	ТабЧасть.Ссылка.Склад                        КАК Склад,
		|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
		|	ТабЧасть.КоличествоУпаковок                  КАК Количество,
		|	ЛОЖЬ                    					 КАК ПоГрафику,
		|	НЕОПРЕДЕЛЕНО           						 КАК РаспоряжениеВГрафике		
		|ИЗ
		|	Документ.БлокировкаДвиженияТоваров.Товары КАК ТабЧасть";
	
		РаспределениеЗапасовДвижения.ПриходЗапаса(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаТабЧасть);	
	КонецЕсли;
	
КонецПроцедуры
	 
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.БлокировкаДвиженияТоваров";
	КомандаПечати.Идентификатор = "ПФ_MXL_ПечатнаяФорма_БлокировкаДвиженияТоваров";
	КомандаПечати.Представление = НСтр("ru = 'Блокировка движения товаров'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.СразуНаПринтер = Ложь;
	КомандаПечати.Порядок = 1; 
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.БлокировкаДвиженияТоваров";
	КомандаПечати.Идентификатор = "ПФ_MXL_ПечатнаяФорма_БлокировкаДвиженияТоваровСЦенойПокупки";
	КомандаПечати.Представление = НСтр("ru = 'Блокировка движения товаров с ценой покупки'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.СразуНаПринтер = Ложь;
	КомандаПечати.Порядок = 2;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПечатнаяФорма_БлокировкаДвиженияТоваров") Тогда
		ТабДок= СформироватьБлокировкуДвиженияТоваров(МассивОбъектов,ОбъектыПечати);		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"ПФ_MXL_ПечатнаяФорма_БлокировкаДвиженияТоваров", НСтр("ru = 'Блокировка движения товаров'"), ТабДок);
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПечатнаяФорма_БлокировкаДвиженияТоваровСЦенойПокупки") Тогда
		ТабДок= СформироватьБлокировкуДвиженияТоваровСЦенойПокупки(МассивОбъектов,ОбъектыПечати);		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"ПФ_MXL_ПечатнаяФорма_БлокировкаДвиженияТоваровСЦенойПокупки", НСтр("ru = 'Блокировка движения товаров с ценой покупки'"), ТабДок);
	КонецЕсли;	
	
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);	

КонецПроцедуры

Функция СформироватьБлокировкуДвиженияТоваров(МассивОбъектов,ОбъектыПечати) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Колонка = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	ВыводитьКоды = ЗначениеЗаполнено(Колонка);
	
	ИспользоватьУпаковкиНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры");

	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.БлокировкаДвиженияТоваров.ПФ_MXL_ПечатнаяФорма_БлокировкаДвиженияТоваров");
	
	ОбластьЗаголовка         = Макет.ПолучитьОбласть("Заголовок");
	
	ОбластьТовары = Макет.Область("Товар");
	ОбластьТовары.ШиринаКолонки = ОбластьТовары.ШиринаКолонки + Макет.Область("КолонкаКодов").ШиринаКолонки;
	
	Если ИспользоватьУпаковкиНоменклатуры Тогда
		ОбластьУпаковокШапка  =  Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаУпаковок");
		ОбластьУпаковокСтрока =  Макет.ПолучитьОбласть("Строка|КолонкаУпаковок");
		ОбластьУпаковокПодвал =  Макет.ПолучитьОбласть("Подвал|КолонкаУпаковок");
	Иначе
		ОбластьТовары = Макет.Область("Товар");
		ОбластьТовары.ШиринаКолонки = ОбластьТовары.ШиринаКолонки 
									  + Макет.Область("КолонкаУпаковокКоличество").ШиринаКолонки
									  + Макет.Область("КолонкаУпаковокПредставление").ШиринаКолонки;
	КонецЕсли;
	
	ОбластьНомераШапка = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
	ОбластьДанныхШапка = Макет.ПолучитьОбласть("ШапкаТаблицы|Товар");
	ОбластьКонецСтрокиШапка = Макет.ПолучитьОбласть("ШапкаТаблицы|КонецСтроки");
	
	ОбластьНомераСтрока = Макет.ПолучитьОбласть("Строка|НомерСтроки");
	ОбластьДанныхСтрока = Макет.ПолучитьОбласть("Строка|Товар");
	ОбластьКонецСтрокиСтрока = Макет.ПолучитьОбласть("Строка|КонецСтроки");
	
	ОбластьНомераПодвал = Макет.ПолучитьОбласть("Подвал|НомерСтроки");
	ОбластьДанныхПодвал = Макет.ПолучитьОбласть("Подвал|Товар");
	ОбластьКонецСтрокиПодвал = Макет.ПолучитьОбласть("Подвал|КонецСтроки");
	
	ОбластьПодписей = Макет.ПолучитьОбласть("Подписи");
	
	ЗапросПоШапке = Новый Запрос;
	ЗапросПоШапке.Текст = 
	"ВЫБРАТЬ
	|	БлокировкаДвиженияТоваров.Ссылка КАК Ссылка,
	|	БлокировкаДвиженияТоваров.Номер КАК Номер,
	|	БлокировкаДвиженияТоваров.Дата КАК Дата,
	|	БлокировкаДвиженияТоваров.Склад.Представление КАК Склад,
	|	БлокировкаДвиженияТоваров.Статус КАК Статус,
	|	БлокировкаДвиженияТоваров.ПричинаБлокировки КАК Причина,
	|	БлокировкаДвиженияТоваров.Ответственный КАК Ответственный,
	|	БлокировкаДвиженияТоваров.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.БлокировкаДвиженияТоваров КАК БлокировкаДвиженияТоваров
	|ГДЕ
	|	БлокировкаДвиженияТоваров.Ссылка В(&МассивДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Дата";
	
	ЗапросПоШапке.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	
	РезультатПоШапке = ЗапросПоШапке.Выполнить().Выгрузить();
	
	ПерваяСтрокаОбъектов = Истина;
	ПервыйДокумент = Истина;
	
	Для Каждого Строка Из РезультатПоШапке Цикл
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		Если Не ПервыйДокумент ИЛИ (ПервыйДокумент И НЕ ПерваяСтрокаОбъектов) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;

			НазваниеДокумента = НСтр("ru = 'Блокировка движения товара'");
			ОбластьЗаголовка.Параметры.ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(Строка,
				НазваниеДокумента);
			ОбластьЗаголовка.Параметры.Заполнить(Строка);
			ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьЗаголовка, Строка.Ссылка);
			ТабличныйДокумент.Вывести(ОбластьЗаголовка);
			
			ТабличныйДокумент.Вывести(ОбластьНомераШапка);
						
			ТабличныйДокумент.Присоединить(ОбластьДанныхШапка);
			
			Если ИспользоватьУпаковкиНоменклатуры Тогда
				ТабличныйДокумент.Присоединить(ОбластьУпаковокШапка);
			КонецЕсли;
			
			ТабличныйДокумент.Присоединить(ОбластьКонецСтрокиШапка);

		ЗапросПоТоварам = Новый Запрос;
		ЗапросПоТоварам.УстановитьПараметр("МассивОбъектов", Строка.Ссылка);
		
		ТекстЗапросаПоТоварам = 
		"ВЫБРАТЬ
		|	ТаблицаТовары.Ссылка КАК Ссылка,
		|	ТаблицаТовары.Номенклатура КАК Товар,
		|	ТаблицаТовары.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
		|	ТаблицаТовары.Номенклатура.Код КАК Код,
		|	ТаблицаТовары.Номенклатура.Артикул КАК Артикул,
		|	ТаблицаТовары.Характеристика.НаименованиеПолное КАК ХарактеристикаНаименование,
		|	ТаблицаТовары.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ТаблицаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаТовары.Номенклатура.ЕдиницаИзмерения)
		|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаТовары.Упаковка)
		|	КОНЕЦ КАК ПредставлениеЕдининицыИзмеренияУпаковки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаТовары.Номенклатура.ЕдиницаИзмерения) КАК ПредставлениеБазовойЕдиницыИзмерения,
		|	ТаблицаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ТаблицаТовары.Количество КАК Количество,
		|	ТаблицаТовары.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Документ.БлокировкаДвиженияТоваров.Товары КАК ТаблицаТовары
		|ГДЕ
		|	ТаблицаТовары.Ссылка В(&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	ТаблицаТовары.НомерСтроки,
		|	Товар,
		|	Характеристика";
		
		ЗапросПоТоварам.Текст = ТекстЗапросаПоТоварам;
		ВыборкаПоТоварам = ЗапросПоТоварам.Выполнить().Выбрать();
					
			// Выборка товаров
			
			НомерСтроки = 1;
			
			Пока ВыборкаПоТоварам.НайтиСледующий(Новый Структура("Ссылка",Строка.Ссылка)) Цикл
				
				ОбластьНомераСтрока.Параметры.НомерСтроки = НомерСтроки;
				ТабличныйДокумент.Вывести(ОбластьНомераСтрока);
												
				ОбластьДанныхСтрока.Параметры.Товар = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
					СокрЛП(ВыборкаПоТоварам.ТоварНаименование),
					СокрЛП(ВыборкаПоТоварам.ХарактеристикаНаименование));
				
				ТабличныйДокумент.Присоединить(ОбластьДанныхСтрока);
				
				Если ИспользоватьУпаковкиНоменклатуры Тогда
					ОбластьУпаковокСтрока.Параметры.Заполнить(ВыборкаПоТоварам);
					ТабличныйДокумент.Присоединить(ОбластьУпаковокСтрока);
				КонецЕсли;
				
				ОбластьКонецСтрокиСтрока.Параметры.Заполнить(ВыборкаПоТоварам);
				ТабличныйДокумент.Присоединить(ОбластьКонецСтрокиСтрока);
				
				НомерСтроки = НомерСтроки + 1;
								
			КонецЦикла;
			
			
			ТабличныйДокумент.Вывести(ОбластьНомераПодвал);
						
			ТабличныйДокумент.Присоединить(ОбластьДанныхПодвал);
			
			Если ИспользоватьУпаковкиНоменклатуры Тогда
				ТабличныйДокумент.Присоединить(ОбластьУпаковокПодвал);
			КонецЕсли;
			
			ТабличныйДокумент.Присоединить(ОбластьКонецСтрокиПодвал);
			
			// Вывести подписи.
			ТабличныйДокумент.Вывести(ОбластьПодписей);
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало,ОбъектыПечати, Строка.Ссылка);
		
		ПерваяСтрокаОбъектов = Ложь;
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;


КонецФункции

Функция СформироватьБлокировкуДвиженияТоваровСЦенойПокупки(МассивОбъектов,ОбъектыПечати) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Колонка = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	ВыводитьКоды = ЗначениеЗаполнено(Колонка);
	
	ИспользоватьУпаковкиНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры");

	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.БлокировкаДвиженияТоваров.ПФ_MXL_ПечатнаяФорма_БлокировкаДвиженияТоваровСЦенойПокупки");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок"); 
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");  
	ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
	
	ЗапросПоШапке = Новый Запрос;
	ЗапросПоШапке.Текст = 
	"ВЫБРАТЬ
	|	БлокировкаДвиженияТоваров.Ссылка КАК Ссылка,
	|	БлокировкаДвиженияТоваров.Номер КАК Номер,
	|	БлокировкаДвиженияТоваров.Дата КАК Дата,
	|	БлокировкаДвиженияТоваров.Склад.Представление КАК Склад,
	|	БлокировкаДвиженияТоваров.Статус КАК Статус,
	|	БлокировкаДвиженияТоваров.ПричинаБлокировки КАК Причина,
	|	БлокировкаДвиженияТоваров.Ответственный КАК Ответственный,
	|	БлокировкаДвиженияТоваров.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.БлокировкаДвиженияТоваров КАК БлокировкаДвиженияТоваров
	|ГДЕ
	|	БлокировкаДвиженияТоваров.Ссылка В(&МассивДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Дата";
	
	ЗапросПоШапке.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	
	РезультатПоШапке = ЗапросПоШапке.Выполнить().Выгрузить();
	
	ПерваяСтрокаОбъектов = Истина;
	ПервыйДокумент = Истина;
	
	Для Каждого Строка Из РезультатПоШапке Цикл
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		Если Не ПервыйДокумент ИЛИ (ПервыйДокумент И НЕ ПерваяСтрокаОбъектов) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;

			НазваниеДокумента = НСтр("ru = 'Блокировка движения товара с ценой покупки'");
			ОбластьЗаголовок.Параметры.ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(Строка,
				НазваниеДокумента);
			ОбластьЗаголовок.Параметры.Заполнить(Строка);
			ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьЗаголовок, Строка.Ссылка);
			ТабличныйДокумент.Вывести(ОбластьЗаголовок); 
			ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
			
		ЗапросПоТоварам = Новый Запрос;
		ЗапросПоТоварам.УстановитьПараметр("МассивОбъектов", Строка.Ссылка);
		
		ТекстЗапросаПоТоварам = 
		"ВЫБРАТЬ
		|	ТаблицаТовары.Ссылка КАК Ссылка,
		|	ТаблицаТовары.Номенклатура КАК Товар,
		|	ТаблицаТовары.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
		|	ТаблицаТовары.Номенклатура.Код КАК Код,
		|	ТаблицаТовары.Номенклатура.Артикул КАК Артикул,
		|	ТаблицаТовары.Характеристика.НаименованиеПолное КАК ХарактеристикаНаименование,
		|	ТаблицаТовары.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ТаблицаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаТовары.Номенклатура.ЕдиницаИзмерения)
		|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаТовары.Упаковка)
		|	КОНЕЦ КАК ПредставлениеЕдининицыИзмеренияУпаковки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаТовары.Номенклатура.ЕдиницаИзмерения) КАК ПредставлениеБазовойЕдиницыИзмерения,
		|	ТаблицаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ТаблицаТовары.Количество КАК Количество,
		|	ТаблицаТовары.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Документ.БлокировкаДвиженияТоваров.Товары КАК ТаблицаТовары
		|ГДЕ
		|	ТаблицаТовары.Ссылка В(&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	ТаблицаТовары.НомерСтроки,
		|	Товар,
		|	Характеристика";
		
		ЗапросПоТоварам.Текст = ТекстЗапросаПоТоварам;
		ВыборкаПоТоварам = ЗапросПоТоварам.Выполнить().Выбрать();
					
			// Выборка товаров
			
			НомерСтроки = 1;
			СуммаИтого = 0;
			
			Пока ВыборкаПоТоварам.НайтиСледующий(Новый Структура("Ссылка",Строка.Ссылка)) Цикл 
				
	
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
					|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
					|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
					|ПОМЕСТИТЬ ВТ_ЦенаПокупки
					|ИЗ
					|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
					|			,
					|			Номенклатура = &Номенклатура
					|				И ВидЦены.Идентификатор = ""ЦенаПокупки""
					|				И Характеристика = &Характеристика) КАК ЦеныНоменклатурыСрезПоследних
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////    
					|ВЫБРАТЬ
					|	СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
					|	СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
					|	(СебестоимостьТоваровОстаткиИОбороты.СтоимостьКонечныйОстаток + СебестоимостьТоваровОстаткиИОбороты.ДопРасходыКонечныйОстаток) / СебестоимостьТоваровОстаткиИОбороты.КоличествоКонечныйОстаток КАК Цена
					|ПОМЕСТИТЬ ВТ_Себестоимость
					|ИЗ
					|	РегистрНакопления.СебестоимостьТоваров.ОстаткиИОбороты(
					|			&НачалоПериода,
					|			&КонецПериода,
					|			,
					|			,
					|			АналитикаУчетаНоменклатуры.Номенклатура = &Номенклатура
					|				И АналитикаУчетаНоменклатуры.Характеристика = &Характеристика
					|				И АналитикаУчетаНоменклатуры.СкладскаяТерритория = &Склад) КАК СебестоимостьТоваровОстаткиИОбороты
					|ГДЕ
					|	СебестоимостьТоваровОстаткиИОбороты.КоличествоКонечныйОстаток > 0
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ЕСТЬNULL(ВТ_ЦенаПокупки.Цена, ВТ_Себестоимость.Цена) КАК Цена
					|ИЗ
					|	ВТ_Себестоимость КАК ВТ_Себестоимость
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦенаПокупки КАК ВТ_ЦенаПокупки
					|		ПО (ИСТИНА)";  
				
				Запрос.Параметры.Вставить("НачалоПериода",НачалоДня(ВыборкаПоТоварам.Ссылка.Дата)); 
				Запрос.Параметры.Вставить("КонецПериода",НачалоДня(ВыборкаПоТоварам.Ссылка.Дата));
				Запрос.Параметры.Вставить("Номенклатура",ВыборкаПоТоварам.Товар);
				Запрос.Параметры.Вставить("Характеристика",ВыборкаПоТоварам.Характеристика);
				Запрос.Параметры.Вставить("Склад",ВыборкаПоТоварам.Ссылка.Склад);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				Выборка = РезультатЗапроса.Выбрать();  
				
				Если Выборка.Следующий() Тогда
					ОбластьСтрока.Параметры.Цена = Выборка.Цена; 
					ОбластьСтрока.Параметры.Сумма = Выборка.Цена*ВыборкаПоТоварам.КоличествоУпаковок;
					СуммаИтого = СуммаИтого + Выборка.Цена*ВыборкаПоТоварам.КоличествоУпаковок;
				Иначе	
					ОбластьСтрока.Параметры.Цена = 0; 
					ОбластьСтрока.Параметры.Сумма = 0;	
				КонецЕсли;
				
				
				ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;  
				ОбластьСтрока.Параметры.Заполнить(ВыборкаПоТоварам);
				ТабличныйДокумент.Вывести(ОбластьСтрока);
												
				НомерСтроки = НомерСтроки + 1;
								
			КонецЦикла;
			
			ОбластьПодвал.Параметры.СуммаИтого = СуммаИтого;
			ТабличныйДокумент.Вывести(ОбластьПодвал);
						
			ТабличныйДокумент.Вывести(ОбластьПодписи);
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало,ОбъектыПечати, Строка.Ссылка);
		
		ПерваяСтрокаОбъектов = Ложь;
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;

КонецФункции

Процедура ЗаполнитьПараметрыИнициализации(Запрос, Документ)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);
	
	УстановитьПривилегированныйРежим(Истина);
	ДатаНачалаДействияПредварительныхБлокировок = Константы.ДатаНачалаДействияПредварительныхБлокировок.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Запрос.УстановитьПараметр("ИспользоватьПредварительныеБлокировки", ?(ДатаНачалаДействияПредварительныхБлокировок=Дата(01,01,0001),Ложь,Истина));
	Запрос.УстановитьПараметр("ДатаНачалаДействияПредварительныхБлокировок", ДатаНачалаДействияПредварительныхБлокировок);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеШапки.Дата КАК Период,
	|	ВЫБОР
	|		КОГДА ДанныеШапки.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
	|				И ДанныеШапки.Дата >= ДанныеШапки.Склад.ДатаНачалаОрдернойСхемыПриПоступлении
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОрдернаяСхемаПриПоступлении,
	|	ВЫБОР
	|		КОГДА (ДанныеШапки.ДокументОснование ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|				ИЛИ ДанныеШапки.ДокументОснование ССЫЛКА Документ.ПеремещениеТоваров
	|				ИЛИ ДанныеШапки.ДокументОснование ССЫЛКА Документ.КорректировкаРеализации)
	|               И ДанныеШапки.БлокировкаОснование = ЗНАЧЕНИЕ(Документ.БлокировкаДвиженияТоваров.ПустаяСсылка) 
	|               И &ИспользоватьПредварительныеБлокировки
	|				И ДанныеШапки.Дата >= &ДатаНачалаДействияПредварительныхБлокировок
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗаполнятьПлановоеКоличество
	|ИЗ
	|	Документ.БлокировкаДвиженияТоваров КАК ДанныеШапки
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период",          	 Реквизиты.Период);
	Запрос.УстановитьПараметр("ОрдернаяСхемаПриПоступлении",          	 Реквизиты.ОрдернаяСхемаПриПоступлении);
	Запрос.УстановитьПараметр("ЗаполнятьПлановоеКоличество",          	 Реквизиты.ЗаполнятьПлановоеКоличество);
	
КонецПроцедуры
		
Функция ТекстЗапросаТаблицаБлокировкаДвиженияНоменклатуры(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "БлокировкаДвиженияТоваров";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	ТаблицаТовары.Ссылка.Склад КАК Склад,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Ссылка.ПричинаБлокировки КАК ПричинаБлокировки,
	|	ВЫБОР
	|		КОГДА &ЗаполнятьПлановоеКоличество
	|				И &ОрдернаяСхемаПриПоступлении
	|			ТОГДА 0
	|		ИНАЧЕ ТаблицаТовары.КоличествоУпаковок
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА &ЗаполнятьПлановоеКоличество
	|				И &ОрдернаяСхемаПриПоступлении
	|			ТОГДА ТаблицаТовары.КоличествоУпаковок
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоПлан
	|ИЗ
	|	Документ.БлокировкаДвиженияТоваров.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	&Период,
	|	ТаблицаТовары.Ссылка.Склад,
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ТаблицаТовары.Ссылка.ПричинаБлокировки,
	|	ТаблицаТовары.КоличествоУпаковок,
	|	0
	|ИЗ
	|	Документ.БлокировкаДвиженияТоваров.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыБлокировкиДвиженияНоменклатуры.Разблокировано)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.БлокировкаДвиженияТоваров) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.БлокировкаДвиженияТоваров.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.БлокировкаДвиженияТоваров);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

Функция ВыполнитьКонтрольБлокировкиПослеПроведения(Ссылка, Отказ) Экспорт
	Успешно = Истина;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БлокировкаДвижения.Номенклатура КАК Номенклатура,
	                      |	БлокировкаДвижения.Характеристика КАК Характеристика,
	                      |	БлокировкаДвижения.Склад КАК Склад,
	                      |	БлокировкаДвижения.ПричинаБлокировки КАК ПричинаБлокировки,
	                      |	-БлокировкаДвижения.КоличествоОстаток КАК Количество,
	                      |	БлокировкаДвижения.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	                      |ИЗ
	                      |	Документ.БлокировкаДвиженияТоваров.Товары КАК БлокировкаДвиженияТоваровТовары
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.БлокировкаДвиженияТоваров.Остатки(, ) КАК БлокировкаДвижения
	                      |		ПО БлокировкаДвиженияТоваровТовары.Номенклатура = БлокировкаДвижения.Номенклатура
	                      |			И БлокировкаДвиженияТоваровТовары.Характеристика = БлокировкаДвижения.Характеристика
	                      |			И БлокировкаДвиженияТоваровТовары.Ссылка.Склад = БлокировкаДвижения.Склад
	                      |			И БлокировкаДвиженияТоваровТовары.Ссылка.ПричинаБлокировки = БлокировкаДвижения.ПричинаБлокировки
	                      |ГДЕ
	                      |	БлокировкаДвижения.КоличествоОстаток < 0
	                      |	И БлокировкаДвиженияТоваровТовары.Ссылка = &Ссылка");
		
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	ШаблонСообщения = НСтр("ru = 'Номенклатура %НоменклатураХарактеристика% 
							|Не заблокирована на складе %Склад% по причине %ПричинаБлокировки% в количестве %Количество% %Единица%'");
			
			
		ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%НоменклатураХарактеристика%",
						НоменклатураКлиентСервер.ПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Количество%", Строка(Выборка.Количество));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Склад%",      Строка(Выборка.Склад));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПричинаБлокировки%",      Строка(Выборка.ПричинаБлокировки));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Единица%",    Строка(Выборка.ЕдиницаИзмерения));

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, ,, Отказ);
		Успешно = Ложь;
	КонецЦикла;
	Возврат Успешно;
КонецФункции

Функция ЕстьОстаткиПоПлановомуКоличеству(Ссылка) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БлокировкаДвиженияТоваровОстатки.Номенклатура КАК Номенклатура,
		|	БлокировкаДвиженияТоваровОстатки.Характеристика КАК Характеристика,
		|	БлокировкаДвиженияТоваровОстатки.ПричинаБлокировки КАК ПричинаБлокировки,
		|	БлокировкаДвиженияТоваровОстатки.КоличествоПланОстаток КАК КоличествоПлан
		|ИЗ
		|	Документ.БлокировкаДвиженияТоваров.Товары КАК ТаблицаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.БлокировкаДвиженияТоваров.Остатки КАК БлокировкаДвиженияТоваровОстатки
		|		ПО ТаблицаТовары.Номенклатура = БлокировкаДвиженияТоваровОстатки.Номенклатура
		|			И ТаблицаТовары.Характеристика = БлокировкаДвиженияТоваровОстатки.Характеристика
		|			И ТаблицаТовары.Ссылка.Склад = БлокировкаДвиженияТоваровОстатки.Склад
		|			И ТаблицаТовары.Ссылка.ПричинаБлокировки = БлокировкаДвиженияТоваровОстатки.ПричинаБлокировки
		|ГДЕ
		|	ТаблицаТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано)
		|	И БлокировкаДвиженияТоваровОстатки.КоличествоПланОстаток <> 0
		|	И (ТаблицаТовары.Ссылка.ДокументОснование ССЫЛКА Документ.ВозвратТоваровОтКлиента
		|			ИЛИ ТаблицаТовары.Ссылка.ДокументОснование ССЫЛКА Документ.ПеремещениеТоваров
		|			ИЛИ ТаблицаТовары.Ссылка.ДокументОснование ССЫЛКА Документ.КорректировкаРеализации)
		|	И ТаблицаТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Функция ПолучитьПриходныеОрдераПоДокументуОснованию(Распоряжение) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
		|ГДЕ
		|	ПриходныйОрдерНаТовары.Проведен = ИСТИНА
		|	И ПриходныйОрдерНаТовары.Распоряжение = &Распоряжение";
	
	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Процедура ПерепровестиПриходныеОрдера(Ссылка,Отказ) Экспорт
	
	Если Не Отказ Тогда
		Если Документы.БлокировкаДвиженияТоваров.ЕстьОстаткиПоПлановомуКоличеству(Ссылка) Тогда
			ПриходныеОрдера = ПолучитьПриходныеОрдераПоДокументуОснованию(Ссылка.ДокументОснование);
			Для Каждого Ордер Из ПриходныеОрдера Цикл
				ОрдерОбъект = Ордер.Ссылка.ПолучитьОбъект();
				ОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры


#КонецЕсли
